时刻淘上线部署手册.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-22 五 15:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/worg/style/worg.css" type="text/css" />
<link rel="alternate stylesheet" title="Zenburn" href="/worg/style/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="/worg/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4eb4044">时刻淘上线部署手册</a>
<ul>
<li><a href="#org7c3ccda">系统环境构建</a>
<ul>
<li><a href="#orga026e16">Centos7 环境搭建</a>
<ul>
<li><a href="#orgec2c98f">基础软件安装</a></li>
<li><a href="#org71f8720">用户设置</a>
<ul>
<li><a href="#org1f94ae6">修改 root 用户密码</a></li>
<li><a href="#orgf7399f0">管理员用户</a></li>
<li><a href="#org3e4827a">ssh 登录用户</a></li>
<li><a href="#orgfb10b01">web 用户</a></li>
</ul>
</li>
<li><a href="#org5ca8757">ssh 安全设置</a></li>
<li><a href="#org0c20d46">防火墙设置</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4eb4044" class="outline-2">
<h2 id="org4eb4044">时刻淘上线部署手册</h2>
<div class="outline-text-2" id="text-org4eb4044">
<p>
时刻淘上线部署手册共分为两大部分，系统环境构建与项目部署。 
</p>
</div>
<div id="outline-container-org7c3ccda" class="outline-3">
<h3 id="org7c3ccda">系统环境构建</h3>
<div class="outline-text-3" id="text-org7c3ccda">
<p>
购买阿里云服务器并搭建 Centos7 最小安装镜像，假设 ip 地址为 120.89.67.90。针对初始化系统的构建，可以分为一下四个部分：1、Centos7 环境搭建，2、软件安装，3、监控系统，4、域名解析。下面针对每一部分进行详细讲解。
</p>
</div>
<div id="outline-container-orga026e16" class="outline-4">
<h4 id="orga026e16">Centos7 环境搭建</h4>
<div class="outline-text-4" id="text-orga026e16">
</div><div id="outline-container-orgec2c98f" class="outline-5">
<h5 id="orgec2c98f">基础软件安装</h5>
<div class="outline-text-5" id="text-orgec2c98f">
<div class="org-src-container">
<pre class="src src-shell">yum remove firewall -y
yum install gcc* make vim iptables-service policycoreutils-python -y
</pre>
</div>
</div>
</div>
<div id="outline-container-org71f8720" class="outline-5">
<h5 id="org71f8720">用户设置</h5>
<div class="outline-text-5" id="text-org71f8720">
<p>
分别创建管理员用户、ssh 登录用户、web 执行用户，并设定随机密码
</p>
</div>
<div id="outline-container-org1f94ae6" class="outline-6">
<h6 id="org1f94ae6">修改 root 用户密码</h6>
<div class="outline-text-6" id="text-org1f94ae6">
<div class="org-src-container">
<pre class="src src-shell">yum -y install expect
mkpasswd -l <span style="color: #a45bad;">16</span> -d <span style="color: #a45bad;">2</span> -C <span style="color: #a45bad;">2</span> -s <span style="color: #a45bad;">2</span> -v root
</pre>
</div>
<p>
上诉代码会设置用户 root 密码形似 wdcK0smaE5kfu_{e
</p>
</div>
</div>
<div id="outline-container-orgf7399f0" class="outline-6">
<h6 id="orgf7399f0">管理员用户</h6>
<div class="outline-text-6" id="text-orgf7399f0">
<div class="org-src-container">
<pre class="src src-shell">useradd babyfunlab -M -U
mkpasswd -l <span style="color: #a45bad;">16</span> -d <span style="color: #a45bad;">2</span> -C <span style="color: #a45bad;">2</span> -s <span style="color: #a45bad;">2</span> -v babyfunlab
</pre>
</div>
<p>
上述命令将会创建没有家目录且组为 babyfunlab 的新用户 babyfunlab 并通过 mkpasswd 命令生成一个 16 位的随机密码，其中-l 密码长度，默认 9;-d 密码中包含数字个数，默认 2；-c 密码中包含小写字母个数，默认 2；-C 密码中包含大写字母个数，默认 2；-s 密码中包含特殊字符的个数，默认 1；-v 指定用户。设定 babyfunlab 用户为管理员用户，拥有 sudo 权限:
</p>
<div class="org-src-container">
<pre class="src src-shell">vim /etc/sudoers
babyfunlab    <span style="color: #7590db;">ALL</span>=<span style="color: #4f97d7;">(</span>ALL<span style="color: #4f97d7;">)</span>    ALL
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e4827a" class="outline-6">
<h6 id="org3e4827a">ssh 登录用户</h6>
<div class="outline-text-6" id="text-org3e4827a">
<div class="org-src-container">
<pre class="src src-shell">useradd bfl -M -U
mkpasswd -l <span style="color: #a45bad;">16</span> -d <span style="color: #a45bad;">2</span> -C <span style="color: #a45bad;">2</span> -s <span style="color: #a45bad;">2</span> -v bfl
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfb10b01" class="outline-6">
<h6 id="orgfb10b01">web 用户</h6>
<div class="outline-text-6" id="text-orgfb10b01">
<div class="org-src-container">
<pre class="src src-shell">useradd www -M -U
</pre>
</div>
<p>
创建 web 项目根目录
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir /home/www
chown -R www:www /home/www/
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5ca8757" class="outline-5">
<h5 id="org5ca8757">ssh 安全设置</h5>
<div class="outline-text-5" id="text-org5ca8757">
<p>
ssh 默认 22 端口，修改大于 20000 以上端口，假设为 22907。默认情况下，Centos7 的 SELinux 是 enforcing 模式，可以通过 sestatus -v 查看，如果不是该模式通过一下方式修改：
</p>
<div class="org-src-container">
<pre class="src src-shell">vim /etc/sysconfig/selinux
<span style="color: #7590db;">SELINUX</span>=enforcing
reboot
</pre>
</div>
<p>
默认 Centos7 的 SELinux 设置 ssh 端口为 22，如果想修改端口，则可以使用 semanage 命令，该命令有 policycoreutils-python 提供。通过下面命令查看 sshd 在 SELinux 中的端口：
</p>
<div class="org-src-container">
<pre class="src src-shell">semanage port -l | grep ssh
ssh_port_t tcp <span style="color: #a45bad;">22</span>
</pre>
</div>
<p>
将 22907 添加到 SELinux 的 ssh_port_t 中：
</p>
<div class="org-src-container">
<pre class="src src-shell">semanage port -a -t ssh_port_t -p tcp <span style="color: #a45bad;">22907</span>
</pre>
</div>
<p>
进一步修改 ssh 配置
</p>
<div class="org-src-container">
<pre class="src src-shell">vim /etc/ssh/sshd_config
Port <span style="color: #a45bad;">22907</span>
LoginGraceTime <span style="color: #a45bad;">30</span> 
MaxAuthTries <span style="color: #a45bad;">3</span> 
Protocol <span style="color: #a45bad;">2</span> 
PermitRootLogin no
AllowUsers bfl
</pre>
</div>
<p>
上述配置中 LoginGraceTime 允许一次登录花费 30 秒，超时不允许访问，需重新登录；MaxAuthTries 把错误尝试的次数限制为 3 次，3 次之后拒绝登录尝试；Protocol 2 禁止使用比较弱的协议，PermitRootLogin no 禁止 root 用户登录，AllowUsers username 只允许 bfl 用户登录，修改完配置重启 sshd 服务。
</p>
<div class="org-src-container">
<pre class="src src-shell">systemctl restart sshd.service
systemctl enable sshd.service
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c20d46" class="outline-5">
<h5 id="org0c20d46">防火墙设置</h5>
<div class="outline-text-5" id="text-org0c20d46">
<p>
只开放 80、443、22907(ssh 端口)端口
</p>
<div class="org-src-container">
<pre class="src src-shell">vim /etc/sysconfig/iptables
-A INPUT -p tcp -m state --state NEW -m tcp --dport <span style="color: #a45bad;">80</span> -j ACCEPT
-A INPUT -p tcp -m state --state NEW -m tcp --dport <span style="color: #a45bad;">443</span> -j ACCEPT
-A INPUT -p tcp -m state --state NEW -m tcp --dport <span style="color: #a45bad;">22907</span> -j ACCEPT

systemctl restart iptables.service
systemctl enable iptables.service
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
                <script type='text/javascript'>
                    /* * * CONFIGURATION VARIABLES * * */
                    var disqus_shortname = 'callmesanye';
                    /* * * DON'T EDIT BELOW THIS LINE * * */
                    (function() {
                        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
                </script>
                <noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript>
                <p> Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 9.0.9) </p>
                <a href='#' class='back-to-top' id='fixed-back-to-top' style='display: inline;'></a>
</div>
</body>
</html>
